```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.closure_expiration_event_lambda.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-05-23 15:31:22 +0000 UTC" -> null
      - id              = "dp-closure-expiration-event-generation:MANAGEMENT_ACCOUNT" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dp-closure-expiration-event-generation" -> null
      - secret_name     = "MANAGEMENT_ACCOUNT" -> null
      - updated_at      = "2023-05-23 15:31:22 +0000 UTC" -> null
    }

  # module.closure_expiration_event_lambda.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-05-23 15:31:23 +0000 UTC" -> null
      - id              = "dp-closure-expiration-event-generation:SLACK_WEBHOOK" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dp-closure-expiration-event-generation" -> null
      - secret_name     = "SLACK_WEBHOOK" -> null
      - updated_at      = "2023-05-23 15:31:23 +0000 UTC" -> null
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_KEY_ID"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-github-actions"
      + secret_name     = "GPG_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_PASSPHRASE"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-github-actions"
      + secret_name     = "GPG_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["GPG_PRIVATE_KEY"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-github-actions"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.dr2_github_actions_scala_steward.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dr2-github-actions"
      + secret_name     = "WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["GPG_PASSPHRASE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:GPG_PASSPHRASE"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["GPG_PRIVATE_KEY"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:GPG_PRIVATE_KEY"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:SLACK_WEBHOOK"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SONATYPE_PASSWORD"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:SONATYPE_PASSWORD"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["SONATYPE_USERNAME"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:SONATYPE_USERNAME"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_client_repository.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-client:WORKFLOW_TOKEN"
      ~ repository      = "dp-preservica-client" -> "dr2-preservica-client"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_config_repository.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-config:MANAGEMENT_ACCOUNT"
      ~ repository      = "dp-preservica-config" -> "dr2-preservica-config"
        # (4 unchanged attributes hidden)
    }

  # module.github_preservica_config_repository.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-preservica-config:SLACK_WEBHOOK"
      ~ repository      = "dp-preservica-config" -> "dr2-preservica-config"
        # (4 unchanged attributes hidden)
    }

  # module.ingest_mapper_environments["intg"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be destroyed
  # (because github_actions_environment_secret.secret is not in configuration)
  - resource "github_actions_environment_secret" "secret" {
      - created_at      = "2023-08-14 14:06:05 +0000 UTC" -> null
      - environment     = "intg" -> null
      - id              = "dr2-ingest-mapper:intg:ACCOUNT_NUMBER" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "ACCOUNT_NUMBER" -> null
      - updated_at      = "2023-08-14 14:06:05 +0000 UTC" -> null
    }

  # module.ingest_mapper_environments["intg"].github_repository_environment.environment will be destroyed
  # (because github_repository_environment.environment is not in configuration)
  - resource "github_repository_environment" "environment" {
      - environment = "intg" -> null
      - id          = "dr2-ingest-mapper:intg" -> null
      - repository  = "dr2-ingest-mapper" -> null

      - reviewers {}
    }

  # module.ingest_mapper_environments["mgmt"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be destroyed
  # (because github_actions_environment_secret.secret is not in configuration)
  - resource "github_actions_environment_secret" "secret" {
      - created_at      = "2023-08-14 14:06:08 +0000 UTC" -> null
      - environment     = "mgmt" -> null
      - id              = "dr2-ingest-mapper:mgmt:ACCOUNT_NUMBER" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "ACCOUNT_NUMBER" -> null
      - updated_at      = "2023-08-14 14:06:08 +0000 UTC" -> null
    }

  # module.ingest_mapper_environments["mgmt"].github_repository_environment.environment will be destroyed
  # (because github_repository_environment.environment is not in configuration)
  - resource "github_repository_environment" "environment" {
      - environment = "mgmt" -> null
      - id          = "dr2-ingest-mapper:mgmt" -> null
      - repository  = "dr2-ingest-mapper" -> null

      - reviewers {
          - teams = [] -> null
          - users = [] -> null
        }
    }

  # module.ingest_mapper_environments["prod"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be destroyed
  # (because github_actions_environment_secret.secret is not in configuration)
  - resource "github_actions_environment_secret" "secret" {
      - created_at      = "2023-08-14 14:06:04 +0000 UTC" -> null
      - environment     = "prod" -> null
      - id              = "dr2-ingest-mapper:prod:ACCOUNT_NUMBER" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "ACCOUNT_NUMBER" -> null
      - updated_at      = "2023-08-14 14:06:04 +0000 UTC" -> null
    }

  # module.ingest_mapper_environments["prod"].github_repository_environment.environment will be destroyed
  # (because github_repository_environment.environment is not in configuration)
  - resource "github_repository_environment" "environment" {
      - environment = "prod" -> null
      - id          = "dr2-ingest-mapper:prod" -> null
      - repository  = "dr2-ingest-mapper" -> null

      - reviewers {
          - teams = [] -> null
          - users = [] -> null
        }
    }

  # module.ingest_mapper_environments["staging"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] will be destroyed
  # (because github_actions_environment_secret.secret is not in configuration)
  - resource "github_actions_environment_secret" "secret" {
      - created_at      = "2023-08-14 14:06:07 +0000 UTC" -> null
      - environment     = "staging" -> null
      - id              = "dr2-ingest-mapper:staging:ACCOUNT_NUMBER" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "ACCOUNT_NUMBER" -> null
      - updated_at      = "2023-08-14 14:06:07 +0000 UTC" -> null
    }

  # module.ingest_mapper_environments["staging"].github_repository_environment.environment will be destroyed
  # (because github_repository_environment.environment is not in configuration)
  - resource "github_repository_environment" "environment" {
      - environment = "staging" -> null
      - id          = "dr2-ingest-mapper:staging" -> null
      - repository  = "dr2-ingest-mapper" -> null

      - reviewers {
          - teams = [] -> null
          - users = [] -> null
        }
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["MANAGEMENT_ACCOUNT"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-14 14:05:57 +0000 UTC" -> null
      - id              = "dr2-ingest-mapper:MANAGEMENT_ACCOUNT" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "MANAGEMENT_ACCOUNT" -> null
      - updated_at      = "2023-08-14 14:05:57 +0000 UTC" -> null
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-14 14:05:58 +0000 UTC" -> null
      - id              = "dr2-ingest-mapper:SLACK_WEBHOOK" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "SLACK_WEBHOOK" -> null
      - updated_at      = "2023-08-14 14:05:58 +0000 UTC" -> null
    }

  # module.ingest_mapper_lambda.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be destroyed
  # (because github_actions_secret.repository_secret is not in configuration)
  - resource "github_actions_secret" "repository_secret" {
      - created_at      = "2023-08-14 14:06:00 +0000 UTC" -> null
      - id              = "dr2-ingest-mapper:WORKFLOW_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "dr2-ingest-mapper" -> null
      - secret_name     = "WORKFLOW_TOKEN" -> null
      - updated_at      = "2023-08-14 14:06:00 +0000 UTC" -> null
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_ACCOUNT_NUMBER"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_ACCOUNT_NUMBER"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_CUSTODIAN_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_CUSTODIAN_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_DYNAMO_TABLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_DYNAMO_TABLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_STATE_BUCKET"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_STATE_BUCKET"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_TERRAFORM_EXTERNAL_ID"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_TERRAFORM_EXTERNAL_ID"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_INTG_TERRAFORM_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_INTG_TERRAFORM_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MANAGEMENT_ACCOUNT"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MANAGEMENT_ACCOUNT"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_ACCOUNT_NUMBER"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_ACCOUNT_NUMBER"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_CUSTODIAN_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_CUSTODIAN_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_DYNAMO_TABLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_DYNAMO_TABLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_STATE_BUCKET"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_STATE_BUCKET"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_TERRAFORM_EXTERNAL_ID"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_TERRAFORM_EXTERNAL_ID"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_MGMT_TERRAFORM_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_MGMT_TERRAFORM_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_ACCOUNT_NUMBER"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_ACCOUNT_NUMBER"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_CUSTODIAN_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_CUSTODIAN_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_DYNAMO_TABLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_DYNAMO_TABLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_STATE_BUCKET"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_STATE_BUCKET"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_TERRAFORM_EXTERNAL_ID"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_TERRAFORM_EXTERNAL_ID"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_PROD_TERRAFORM_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_PROD_TERRAFORM_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_SLACK_WEBHOOK"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_SLACK_WEBHOOK"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_ACCOUNT_NUMBER"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_ACCOUNT_NUMBER"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_CUSTODIAN_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_CUSTODIAN_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_DYNAMO_TABLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_DYNAMO_TABLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_STATE_BUCKET"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_STATE_BUCKET"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_TERRAFORM_EXTERNAL_ID"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_TERRAFORM_EXTERNAL_ID"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_STAGING_TERRAFORM_ROLE"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_STAGING_TERRAFORM_ROLE"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository.github_actions_secret.repository_secret["DR2_WORKFLOW_PAT"] will be updated in-place
  ~ resource "github_actions_secret" "repository_secret" {
        id              = "dp-terraform-environments:DR2_WORKFLOW_PAT"
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments"
        # (4 unchanged attributes hidden)
    }

  # module.terraform_environments_repository_environments["intg"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] must be replaced
-/+ resource "github_actions_environment_secret" "secret" {
      ~ created_at      = "2023-06-08 11:23:18 +0000 UTC" -> (known after apply)
      ~ id              = "dp-terraform-environments:intg:ACCOUNT_NUMBER" -> (known after apply)
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
      ~ updated_at      = "2023-06-08 11:23:18 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.terraform_environments_repository_environments["intg"].github_repository_environment.environment must be replaced
-/+ resource "github_repository_environment" "environment" {
      ~ id          = "dp-terraform-environments:intg" -> (known after apply)
      ~ repository  = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
        # (1 unchanged attribute hidden)

      ~ reviewers {
          - users = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.terraform_environments_repository_environments["mgmt"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] must be replaced
-/+ resource "github_actions_environment_secret" "secret" {
      ~ created_at      = "2023-06-14 08:50:01 +0000 UTC" -> (known after apply)
      ~ id              = "dp-terraform-environments:mgmt:ACCOUNT_NUMBER" -> (known after apply)
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
      ~ updated_at      = "2023-06-14 08:50:01 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.terraform_environments_repository_environments["mgmt"].github_repository_environment.environment must be replaced
-/+ resource "github_repository_environment" "environment" {
      ~ id          = "dp-terraform-environments:mgmt" -> (known after apply)
      ~ repository  = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
        # (1 unchanged attribute hidden)

      ~ reviewers {
          - users = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.terraform_environments_repository_environments["prod"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] must be replaced
-/+ resource "github_actions_environment_secret" "secret" {
      ~ created_at      = "2023-06-08 11:23:16 +0000 UTC" -> (known after apply)
      ~ id              = "dp-terraform-environments:prod:ACCOUNT_NUMBER" -> (known after apply)
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
      ~ updated_at      = "2023-06-08 11:23:16 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.terraform_environments_repository_environments["prod"].github_repository_environment.environment must be replaced
-/+ resource "github_repository_environment" "environment" {
      ~ id          = "dp-terraform-environments:prod" -> (known after apply)
      ~ repository  = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
        # (1 unchanged attribute hidden)

      ~ reviewers {
          - users = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.terraform_environments_repository_environments["staging"].github_actions_environment_secret.secret["ACCOUNT_NUMBER"] must be replaced
-/+ resource "github_actions_environment_secret" "secret" {
      ~ created_at      = "2023-06-08 11:23:19 +0000 UTC" -> (known after apply)
      ~ id              = "dp-terraform-environments:staging:ACCOUNT_NUMBER" -> (known after apply)
      ~ repository      = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
      ~ updated_at      = "2023-06-08 11:23:19 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.terraform_environments_repository_environments["staging"].github_repository_environment.environment must be replaced
-/+ resource "github_repository_environment" "environment" {
      ~ id          = "dp-terraform-environments:staging" -> (known after apply)
      ~ repository  = "dp-terraform-environments" -> "dr2-terraform-environments" # forces replacement
        # (1 unchanged attribute hidden)

      ~ reviewers {
          - users = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 12 to add, 35 to change, 21 to destroy.
```